% εισαγουμε :
%                 τα μοναδιαια διανυσματα που οριζουν το επιπεδο της ελλειψης(Uκαι V)

%                 τα μηκη της ελλειψης (a και b) και το κεντρο της ελλειψης σε πολικες(C)

%                 την γωνια του κεντρικου αξονα της ελλειψης πανω στο
%                 επιπεδο στο οποιο βρισκετε (w).Εδω κολλαει η τριτη γωνια
%                 που δεν μπορουσα να ενσωματωσω.

% Εξαγουμε :

%                τις πολικες συντεταγμενες του σρχικου σημειου της
%                ελλειψης καισ ε ενα 1X3 πινακα(D) και
%                ξεχωριστα(Daz,Del,Dr)

%                ετσι βρισκουμε 1 σημειο(την "γωνια" της ελλειψης απο την
%                μερια που ειναι η γη)
%                εαν βαλουμε στο w=w+t βλεπουμε ολη την ελειψη (t  τα
%                σημεια απο 0 ως 360)
%                αν βαλουμε w=T(true anomaly) βρισκουμε το σημειο που
%                βρισκετε ο δορυφορος


%               http://mathforum.org/library/drmath/view/63373.html (απο
%               εδω βρηκα την εξισωση για την τρισδιαστατη ελλειψη, και
%               προσαρμοσα τα μοναδιαιο διανυσματα,το κεντρο της ελλειψης
%               και την γωνια που στρεφεται στο επιπεδο απο τα στοιχεια που
%               περνω απο το TLE
%               
function [D,Daz,Del,Dr]=elli3d(C,U,V,w,a,b);
     [u(1,1),u(1,2),u(1,3)]=sph2cart(U(1,1),U(1,2),U(1,3));
     [v(1,1),v(1,2),v(1,3)]=sph2cart(V(1,1),V(1,2),V(1,3));
    Dx=C(1,1)+a*cos(w)*u(1,1)+b*sin(w)*v(1,1);
    Dy=C(1,2)+a*cos(w)*u(1,2)+b*sin(w)*v(1,2);
    Dz=C(1,3)+a*cos(w)*u(1,3)+b*sin(w)*v(1,3);
    [Daz,Del,Dr]=cart2sph(Dx,Dy,Dz);
    D=[Daz,Del,Dr];
end